𝑺𝑼𝑲𝑼𝑵𝑨 𝑩𝑶𝑻
*𝓦𝓮𝓵𝓬𝓸𝓶𝓮 𝓽𝓸 ⁀➴*
*_˚₊ Ai 🍷𝅏 𝖢𝖮𝖬𝖬𝖠𝖭𝖣𝖲 ₊˚_*

*╼֪ׄ╾╼ׁ֪╾ִ╼⌬❄️⌬ ╼֪ׄ╾╼ׁ֪╾ִ╼֪╾*
*˼❄˹┊الأمــر ⇜╵ `تخيل2`╷☇*
*˼❄˹┊الأمــر ⇜╵ `نانو`╷☇*
*˼❄˹┊الأمــر ⇜╵ `أنيا`╷☇*
*˼❄˹┊الأمــر ⇜╵ `توليد_فيديو`╷☇*
*˼❄˹┊الأمــر ⇜╵ `كلود`╷☇*
*˼❄˹┊الأمــر ⇜╵ `ديب_سيك`╷☇*
*˼❄˹┊الأمــر ⇜╵ `تعديل`╷☇*
*˼❄˹┊الأمــر ⇜╵ `تبديل`╷☇*
*˼❄˹┊الأمــر ⇜╵ `ارسم`╷☇*
*˼❄˹┊الأمــر ⇜╵ `فرام`╷☇*
*˼❄˹┊الأمــر ⇜╵ `جارز`╷☇*
*˼❄˹┊الأمــر ⇜╵ `جيميناي`╷☇*
*˼❄˹┊الأمــر ⇜╵ `شات`╷☇*
*˼❄˹┊الأمــر ⇜╵ `تخيل`╷☇*
*˼❄˹┊الأمــر ⇜╵ `ميمو`╷☇*
*˼❄˹┊الأمــر ⇜╵ `ناسا`╷☇*
*˼❄˹┊الأمــر ⇜╵ `نوتراك`╷☇*
*˼❄˹┊الأمــر ⇜╵ `لكرتون`╷☇*
*˼❄˹┊الأمــر ⇜╵ `زرفيدا`╷☇*
*╼֪ׄ╾╼ׁ֪╾ִ╼⌬❄️⌬ ╼֪ׄ╾╼ׁ֪╾ִ╼֪╾*


 𝑺𝑼𝑲𝑼𝑵𝑨 𝑩𝑶𝑻
*𝓦𝓮𝓵𝓬𝓸𝓶𝓮 𝓽𝓸 ⁀➴*
*_˚₊ Ai 🍷𝅏 𝖢𝖮𝖬𝖬𝖠𝖭𝖣𝖲 ₊˚_*

*╼֪ׄ╾╼ׁ֪╾ִ╼⌬❄️⌬ ╼֪ׄ╾╼ׁ֪╾ִ╼֪╾*
*˼❄˹┊الأمــر ⇜╵ `تخيل2`╷☇*
*˼❄˹┊الأمــر ⇜╵ `نانو`╷☇*
*˼❄˹┊الأمــر ⇜╵ `أنيا`╷☇*
*˼❄˹┊الأمــر ⇜╵ `توليد_فيديو`╷☇*
*˼❄˹┊الأمــر ⇜╵ `كلود`╷☇*
*˼❄˹┊الأمــر ⇜╵ `ديب_سيك`╷☇*
*˼❄˹┊الأمــر ⇜╵ `تعديل`╷☇*
*˼❄˹┊الأمــر ⇜╵ `تبديل`╷☇*
*˼❄˹┊الأمــر ⇜╵ `ارسم`╷☇*
*˼❄˹┊الأمــر ⇜╵ `فرام`╷☇*
*˼❄˹┊الأمــر ⇜╵ `جارز`╷☇*
*˼❄˹┊الأمــر ⇜╵ `جيميناي`╷☇*
*˼❄˹┊الأمــر ⇜╵ `شات`╷☇*
*˼❄˹┊الأمــر ⇜╵ `تخيل`╷☇*
*˼❄˹┊الأمــر ⇜╵ `ميمو`╷☇*
*˼❄˹┊الأمــر ⇜╵ `ناسا`╷☇*
*˼❄˹┊الأمــر ⇜╵ `نوتراك`╷☇*
*˼❄˹┊الأمــر ⇜╵ `لكرتون`╷☇*
*˼❄˹┊الأمــر ⇜╵ `زرفيدا`╷☇*
*╼֪ׄ╾╼ׁ֪╾ִ╼⌬❄️⌬ ╼֪ׄ╾╼ׁ֪╾ִ╼֪╾*


 𝑺𝑼𝑲𝑼𝑵𝑨 𝑩𝑶𝑻
*𝓦𝓮𝓵𝓬𝓸𝓶𝓮 𝓽𝓸 ⁀➴*
*_˚₊ Admin 🍷𝅏 𝖢𝖮𝖬𝖬𝖠𝖭𝖣𝖲 ₊˚_*

*╼֪ׄ╾╼ׁ֪╾ִ╼⌬❄️⌬ ╼֪ׄ╾╼ׁ֪╾ִ╼֪╾*
*˼❄˹┊الأمــر ⇜╵ `جماعي`╷☇*
*˼❄˹┊الأمــر ⇜╵ `فتح_الكل`╷☇*
*˼❄˹┊الأمــر ⇜╵ `رقي`╷☇*
*˼❄˹┊الأمــر ⇜╵ `نشاط`╷☇*
*˼❄˹┊الأمــر ⇜╵ `طلبات`╷☇*
*˼❄˹┊الأمــر ⇜╵ `تغيير`╷☇*
*˼❄˹┊الأمــر ⇜╵ `شات_بوت`╷☇*
*˼❄˹┊الأمــر ⇜╵ `قفل_امر`╷☇*
*˼❄˹┊الأمــر ⇜╵ `فتح_امر`╷☇*
*˼❄˹┊الأمــر ⇜╵ `تحديد_عملة`╷☇*
*˼❄˹┊الأمــر ⇜╵ `افتراضي`╷☇*
*˼❄˹┊الأمــر ⇜╵ `مسح`╷☇*
*˼❄˹┊الأمــر ⇜╵ `وداع`╷☇*
*˼❄˹┊الأمــر ⇜╵ `دعوة`╷☇*
*˼❄˹┊الأمــر ⇜╵ `رسائل`╷☇*
*˼❄˹┊الأمــر ⇜╵ `مخفي`╷☇*
*˼❄˹┊الأمــر ⇜╵ `طرد`╷☇*
*˼❄˹┊الأمــر ⇜╵ `ترقيات`╷☇*
*˼❄˹┊الأمــر ⇜╵ `الاوامر_المقفولة`╷☇*
*˼❄˹┊الأمــر ⇜╵ `مود`╷☇*
*˼❄˹┊الأمــر ⇜╵ `قفل`╷☇*
*˼❄˹┊الأمــر ⇜╵ `طلبات_الانضمام`╷☇*
*˼❄˹┊الأمــر ⇜╵ `ثبت`╷☇*
*˼❄˹┊الأمــر ⇜╵ `تجديد_اللينك`╷☇*
*˼❄˹┊الأمــر ⇜╵ `حذف_تحذير`╷☇*
*˼❄˹┊الأمــر ⇜╵ `تعيين_وداع`╷☇*
*˼❄˹┊الأمــر ⇜╵ `تعيين_ترحيب`╷☇*
*˼❄˹┊الأمــر ⇜╵ `ستوري`╷☇*
*˼❄˹┊الأمــر ⇜╵ `تاغ`╷☇*
*˼❄˹┊الأمــر ⇜╵ `توب_رانك`╷☇*
*˼❄˹┊الأمــر ⇜╵ `فتح`╷☇*
*˼❄˹┊الأمــر ⇜╵ `تحذير`╷☇*
*˼❄˹┊الأمــر ⇜╵ `عدد_التحذيرات`╷☇*
*˼❄˹┊الأمــر ⇜╵ `مراقبة_الكل`╷☇*
*˼❄˹┊الأمــر ⇜╵ `مراقبة_اعضاء`╷☇*
*˼❄˹┊الأمــر ⇜╵ `مراقبة_اعدادات`╷☇*
*˼❄˹┊الأمــر ⇜╵ `مراقبة_اشراف`╷☇*
*˼❄˹┊الأمــر ⇜╵ `ترحيب`╷☇*
*˼❄˹┊الأمــر ⇜╵ `ازل`╷☇*
*╼֪ׄ╾╼ׁ֪╾ִ╼⌬❄️⌬ ╼֪ׄ╾╼ׁ֪╾ִ╼֪╾*


 var commands = [];

function cmd(info, func) {
    var data = info;
    data.function = func;
    if (!data.dontAddCommandList) data.dontAddCommandList = false;
    if (!info.desc) info.desc = '';
    if (!data.fromMe) data.fromMe = false;
    if (!info.category) data.category = 'misc';
    if(!info.filename) data.filename = "Not Provided";
    commands.push(data);
    return data;
}
module.exports = {
    cmd,
    AddCommand:cmd,
    Function:cmd,
    Module:cmd,
    commands,
};
